[{"Excerice Name": "BACKWARD MEDICINE BALL THROW", "Description": "Starting Position:\n Stand with feet shoulder-width apart, knees slightly bent, and engage your core.\n\nGrip and Wrist Alignment:\n Hold the medicine ball firmly with wrists in a neutral position.\n\nOverhead Extension:\n Extend your arms upward, raising the medicine ball above your head.\n\nForceful Backward Throw: \nGenerate power and explosively throw the medicine ball backward.\n\nFollow-through Motion:\n Allow your arms to fully extend as you follow through with the throw.\n\nMaintain Posture and Core Engagement:\n Keep a straight posture and activate your core for stability.\n\nRepeat:\n Retrieve the medicine ball and perform the exercise for the desired number of repetitions.\n", "VideoLink": "", "EQUIPMENT": "Exercise Ball"}, {"Excerice Name": "ZERCHER CARRY", "Description": "Load the Weight:\n Select the desired weight and load it onto a barbell. Begin with a lighter weight to focus on \nproper form and gradually increase as you build strength.\n\nGrip the Weight:\n Stand in front of the barbell with feet shoulder-width apart. Squat down and grasp the barbell \nwith both hands, positioning it in the bend of your elbows near your chest. Maintain forward-pointing elbows \nand rest your hands on your biceps.\n\nStand Up:\n Rise from the squat position while keeping the weight secure in the crook of your elbows. Maintain a \nlifted chest, shoulders back, and engage your core for proper posture.\n\nWalk:\n Initiate a controlled walk, taking steady and deliberate steps. Keep your posture straight, avoiding \nexcessive bending or leaning to the sides. Maintain a forward gaze to support balance.\n", "VideoLink": "", "EQUIPMENT": "Barbell"}, {"Excerice Name": "WALL WALK", "Description": "Starting Position:\n Begin by lying face down on the floor, ensuring your body forms a straight line from head to \nheels.\n\nHand Placement and Ascent:\n Position your hands on the ground and gradually walk your feet up the wall, \nsteadily moving into a handstand position where your feet touch the wall.\n\nHold and Control:\n Maintain the handstand position for a brief pause, focusing on balance and stability. Then, \ncarefully lower yourself back to the starting position by walking your feet down the wall in a controlled manner.\n\nRepeat and Progress:\n Repeat the exercise for the desired number of sets and repetitions, gradually challenging \nyourself to increase difficulty or duration as you progress.\n", "VideoLink": "", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "KETTLEBELL HANG CLEAN", "Description": "Starting Position: \nBegin by standing with your feet hip-width apart, and place the kettlebell between your feet.\n\nGrip and Squat:\n Squat down and firmly grasp the kettlebell with both hands, ensuring an overhand grip.\n\nExplosive Lift:\n Swiftly extend your hips and knees to generate power, pulling the kettlebell up towards your chest.\n\nRack Position:\n As the kettlebell reaches chest level, rotate your elbows around it, bringing it into the rack position \nclose to your chest.\n\nPause and Control:\n Hold the kettlebell in the rack position for a brief moment, allowing your muscles to stabilize. \nMaintain control and engage your core throughout the exercise.\n\nLowering:\n Slowly and with control, lower the kettlebell back to the starting position, maintaining proper form and \npreventing any sudden movements.\n", "VideoLink": "", "EQUIPMENT": "Kettlebell"}, {"Excerice Name": "DUMBBELL POWER CLEAN", "Description": "Starting Position:\n Stand with your feet shoulder-width apart, holding a dumbbell in each hand, and let your arms \nhang naturally by your sides.\n\nPartial Squat: \nLower your body into a partial squat by bending at the hips and knees, maintaining a straight \nback, lifted chest, and engaged core.\n\nExplosive Lift: \nDrive through your hips, knees, and ankles in a powerful motion, raising the dumbbells upward. \nKeep your elbows high and out to the sides, pulling the dumbbells close to your body.\n\nCatch Position:\n As the dumbbells reach chest level, swiftly drop into a quarter-squat position and rotate your \nelbows forward, catching the dumbbells in front of your shoulders. Ensure your palms face your body.\n\nStabilize and Hold:\n Hold the catch position momentarily, engaging your core and stabilizing your body. Maintain\n proper posture with your shoulders back and chest lifted.\n\nLowering:\n Slowly and controlled, lower the dumbbells back to the starting position, flexing your hips and knees. \nKeep your back straight throughout the movement.\n\nRepeat:\n Perform the power clean for the desired number of repetitions, focusing on maintaining form and control\n with each repetition.\n", "VideoLink": "", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "DUMBBELL DEVIL PRESS", "Description": "Starting Position: \nStand with your feet shoulder-width apart, gripping a dumbbell in each hand at shoulder level, \npalms facing your body.\n\nSquat and Lower:\n Descend into a squat position, maintaining proper posture with a straight back and lifted \nchest. Place the dumbbells on the ground, ensuring they are shoulder-width apart while keeping your hands on \nthe handles.\n\nKick Back and Jump:\n Kick your legs back, transitioning into a plank position, while firmly gripping the dumbbells. \nExecute a push-up, lowering your chest towards the ground. Propel yourself upwards explosively, jumping your \nfeet forward to return to a squat position.\n\nClean and Press:\n Utilize the upward momentum from the squat to stand upright, simultaneously pulling the \ndumbbells towards your shoulders. As you reach a standing position, extend your arms overhead, fully \nstraightening them.\n\nLower and Repeat:\n Lower the dumbbells back to shoulder level, then gradually lower them to the ground while \nkicking your legs back into a plank position. Repeat the entire sequence for your desired number of repetitions.\n", "VideoLink": "", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "FARMER’S WALK", "Description": "Set-Up:\n\nBegin by standing with feet shoulder-width apart and maintain a neutral spine. Hold a heavy dumbbell or \nkettlebell in each hand using a neutral grip.\n\nEngage Your Core:\n\nActivate your core muscles by drawing your belly button towards your spine. Keep shoulders down and back, and \nmaintain an elevated chest throughout the exercise.\n\nControlled Walking:\n\nTake deliberate, measured steps while focusing on maintaining an upright posture. Allow your arms to hang \nnaturally by your sides with straight elbows.\n\nStability is Key:\n\nPrioritize stability by keeping your core engaged and shoulders stabilized. Avoid excessive swinging or leaning to \neither side.\n\nDistance or Time:\n\nDetermine a specific distance to walk or set a time limit for your farmer's walk, based on your fitness level and \ngoals. Gradually increase weight as you build strength and feel more comfortable with the exercise.\n\nIncorporating farmer's walks into your fitness routine helps develop overall strength and stability throughout your \nbody. This exercise targets multiple muscle groups, including the core, shoulders, arms, and legs, providing a \ncomprehensive full-body workout. Maintain proper form, engage your core, and progressively challenge \nyourself by increasing weight, leading to continuous progress and maximizing the benefits of this functional \nexercise.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "VideoLink": "", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "TIRE FLIP", "Description": "Starting Position: Stand with your feet shoulder-width apart, positioned behind the tire.\nGrip and Lift: Bend down and firmly grasp the bottom of the tire with both hands, maintaining a secure grip.\nPower from Legs and Hips: Engage your leg and hip muscles as you drive them forward, using the force to lift the tire off the ground. Keep your back straight and maintain an upright head position throughout.\nPush and Flip: Utilize the strength of your legs and hips to push the tire over to the opposite side, using controlled movements.\nRepeat: Continue the flipping motion, alternating sides, for the desired number of repetitions.", "VideoLink": "", "EQUIPMENT": "TIRE"}, {"Excerice Name": "BARBELL SNATCH", "Description": "Starting Position: \nStand with your feet shoulder-width apart and toes slightly pointed outward. Place the barbell \non the floor in front of you, positioning it close to your shins. Grasp the bar with an overhand grip, slightly wider \nthan shoulder-width apart.\n\nGrip and Lift:\n Bend your knees and hinge at the hips, maintaining a straight back and engaged core. Using a \npowerful and explosive motion, extend your hips, knees, and ankles to lift the barbell off the ground.\n\nPull and Catch:\n As the barbell reaches hip level, swiftly pull it upward while keeping it close to your body. \nSimultaneously, drop into a partial squat by bending your knees and hips. As the barbell reaches its highest \npoint, swiftly position yourself beneath it, rotating your elbows around the bar, and catch the barbell overhead \nwith your arms locked in a stable position.\n\nStand and Stabilize:\n Rise up vigorously from the squat position, driving through your heels and fully extending \nyour hips, knees, and ankles. Maintain the overhead position of the barbell and stabilize your body.\n\nLower and Repeat: \nLower the barbell with control, following the reverse motion of the snatch. Return to the \nstarting position and repeat the exercise for the desired number of repetitions.\n", "VideoLink": "", "EQUIPMENT": "Barbell"}, {"Excerice Name": "POWER SNATCH", "Description": "Starting Position:\n  Stand with your feet shoulder-width apart and toes slightly angled outward. Place the barbell\n near your shins on the floor. Use an overhand grip, slightly wider than shoulder-width apart, to hold the barbell.\n \nGrip and Lift:\n  Bend your knees and hinge at the hips while maintaining a straight back and engaged core. With \n an explosive motion, extend your hips, knees, and ankles to lift the barbell off the ground.\n \nPull and Catch:\n  As the barbell reaches hip level, rapidly pull it upward by fully extending your hips, knees, and \n ankles. Keep your arms straight and pull the barbell close to your body. At the highest point, drop quickly under \n the barbell by bending your knees and hips, rotating your elbows around the bar. Catch the barbell overhead \n with locked-out arms in a stable position.\n \nStand and Stabilize: \n Rise up from the squat position by explosively extending your hips, knees, and ankles. \n Maintain control of the barbell overhead and stabilize your body in an upright position.\n \nLower and Repeat:\n  Lower the barbell with control, reversing the movement of the power snatch. Return to the \n starting position and repeat the exercise for the desired number of reps.\n ", "VideoLink": "", "EQUIPMENT": "Barbell"}]