[{"Excerice Name": "DUMBBELL KICKBACK", "Description": "Positioning: \n Stand with your feet hip-width apart and maintain a slight bend in your knees. Hinge forward at the\n hips, keeping your back straight.\n \nGrip and Alignment:\n  Hold a dumbbell in one hand, and keep your upper arm parallel to your body with the elbow \n bent at a 90-degree angle.\n \nExtension:\n  Engage your triceps by extending your forearm backward, straightening your arm while keeping your \n upper arm stationary.\n \nContract and Pause:\n  At the top of the movement, pause briefly to fully contract your triceps, focusing on the \n muscle engagement.\n \nControlled Lowering:\n  Slowly lower the dumbbell back to the starting position with controlled movement, \n maintaining proper form throughout.\n \nRepeat and Alternate:\n  Complete the desired number of repetitions on one arm before switching to the other \n arm.\n \nBreathing:\n  Maintain a steady breath throughout the exercise, inhaling and exhaling naturally.\n \nWeight Selection:\n  Choose a weight that challenges your triceps while allowing you to maintain proper form \n and control.\n \nRegular Incorporation:\n  Include dumbbell kickbacks consistently in your workout routine to effectively target \n and strengthen your triceps.\n \nBenefits:\n  Dumbbell kickbacks can help sculpt and strengthen your triceps, contributing to improved arm \n strength and definition.\n ", "VideoLink": "https:\/\/i.postimg.cc\/SQtwVcKt\/DUMBBELL-KICKBACK.gif", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "BENCH DIPS", "Description": "Starting Position:\n Sit on the edge of a bench and position your hands beside your hips, fingers facing\n forward.\n \nFoot Placement:\n Extend your feet slightly in front of you and lift your body off the bench.\n \nExecution:\n Inhale as you lower your body towards the floor, holding for a moment, then exhale as you push \nyourself back up.\n\nTrainer Tips:\n Pay attention to your range of motion, limiting it to a 90-degree bend at the elbow to avoid \nexcessive stress on the shoulders. Adjust the range of motion based on your body's comfort level. If your \nshoulders feel tight, consider stretching them and the surrounding muscles before attempting bench dips.\n", "VideoLink": "https:\/\/i.postimg.cc\/fbjGvF3x\/BENCH-DIPS.gif", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "ONE ARM LYING TRICEPS EXTENSION", "Description": "Starting Position:\n Lie on a bench with one hand holding a dumbbell, using your opposite hand to guide the\n positioning of your shoulder and elbow.\n\nDumbbell Position:\n Grip the dumbbell with your hand, ensuring it is pointing towards the ceiling.\n\nExecution:\n Inhale as you lower the dumbbell towards the side of your head, pausing briefly, then exhale as\nyou return to the starting position.\n\nKey Points:\n Maintain stability in your shoulders throughout the exercise, focusing on the movement of your \nelbow. This triceps exercise targets the muscle group effectively when performed with correct form.\n", "VideoLink": "https:\/\/i.postimg.cc\/hjZ3yqK7\/ONE-ARM-LYING-TRICEPS-EXTENSION.gif", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "LYING BARBELL TRICEPS EXTENSION", "Description": "Starting Position:\n Lie on a bench with your feet planted firmly on the ground. Grasp the barbell with an \noverhand grip, hands slightly narrower than shoulder-width apart.\n\nMaintain Proper Form:\n Lower the barbell towards your forehead by bending your elbows, ensuring they stay \nclose to your head throughout the movement.\n\nControlled Movement:\n Pause briefly when the barbell is near your forehead, then extend your arms back up \nto the starting position, focusing on a controlled and steady motion.\n\nEngage Core Muscles:\n Keep your core muscles engaged to maintain stability and prevent excessive arching\n of the lower back during the exercise.\n\nBreathing Technique:\n Exhale as you extend your arms and inhale as you lower the barbell towards your \nforehead.\n", "VideoLink": "https:\/\/i.postimg.cc\/SsgHBMfR\/LYING-BARBELL-TRICEPS-EXTENSION.gif", "EQUIPMENT": "Barbell"}, {"Excerice Name": "TRICEPS DIPS ON FLOOR", "Description": "Starting Position:\n Sit on the floor with your feet flat on the ground and knees bent. Position your hands on \nthe floor behind you, fingers facing forward.\n\nLift Your Hips:\n Engage your core muscles and lift your hips off the ground, ensuring your elbows remain \nstraight throughout the movement.\n\nControlled Descent:\n Bend your elbows to gradually lower your body towards the ground while maintaining a \nstraight back and keeping your shoulders down.\n\nPause and Contract: \nPause briefly at the bottom of the movement, feeling the stretch in your triceps. Keep \nyour elbows tucked in and avoid excessive strain on your shoulders.\n\nPush Back Up: \nEngage your triceps and push through your palms to extend your arms, returning to the \nstarting position with control.\n", "VideoLink": "https:\/\/i.postimg.cc\/QCRYDk98\/TRICEPS-DIPS-ON-FLOOR.gif", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "DUMBBELL SEATED FRONT AND BACK TATE PRESS", "Description": "Seated Position:\n Sit comfortably on a bench with your feet planted firmly on the ground, maintaining an\n upright posture for stability.\n\nFront Tate Press:\n Grasp a pair of dumbbells in each hand, palms facing inward. Position your upper arms\n parallel to the floor, elbows bent at a right angle, and the dumbbells in front of your shoulders.\n\nPress Forward:\n Extend your arms forward, ensuring the dumbbells remain close together throughout the \nmovement. Maintain control as you fully straighten your arms, avoiding locking your elbows.\n\nBack Tate Press:\n Transition smoothly from the extended position by retracting your arms backward, while \nkeeping the dumbbells close together. Aim to move your upper arms parallel to the floor.\n\nPause and Contract:\n Hold the contracted position briefly, focusing on engaging your triceps and feeling the \ntension in the back of your arms.\n\nReturn to Starting Position:\n With control, reverse the movement by bringing the dumbbells back to the front\n of your shoulders, maintaining a steady and deliberate pace.\n\nRepeat:\n Perform the desired number of repetitions, alternating between front and back Tate presses to work \nyour triceps effectively.\n", "VideoLink": "https:\/\/i.postimg.cc\/W10C2KwQ\/DUMBBELL-SEATED-FRONT-AND-BACK-TATE-PRESS.gif", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "NARROW GRIP WALL PUSH-UP", "Description": "Position yourself:\n Stand facing a wall at a comfortable distance\n\nNarrow grip placement: Place your hands on the wall, closer together than the width of your shoulders\n\nStep back:\n Take a step back, extending your arms and aligning them with your shoulders\n\nMaintain proper alignment:\n Keep your body in a straight line from head to toe, engaging your core for \nstability\n\nLower your chest\n: Bend your elbows to lower your chest towards the wall while keeping your body steady \nand maintaining a neutral spine\n\nPause and feel the contraction:\n Pause briefly when your chest is near the wall, focusing on the contraction in \nyour chest and triceps\n\nPush away from the wall:\n Straighten your arms to push yourself away from the wall, returning to the starting\n position\n\nRepeat for desired reps:\n Perform the movement for the desired number of repetitions, focusing on\n maintaining proper form and a controlled pace\n\nAdjust difficulty level:\n Modify the exercise by adjusting the distance from the wall to increase or decrease \nthe difficulty\n\nBreathe consistently:\n Remember to breathe continuously throughout the exercise, exhaling as you push\n away from the wall and inhaling as you lower your chest\n\n", "VideoLink": "https:\/\/i.postimg.cc\/sXjtHcSb\/NARROW-GRIP-WALL-PUSH-UP.gif", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "BODY UPS", "Description": "Starting position:\n Stand in front of a sturdy elevated surface, such as a pull-up bar or parallel bars.\n\nGrip the surface: \nFirmly hold onto the surface with your hands, positioning them slightly wider than shoulder-width apart.\n\nEngage your core:\n Activate your abdominal muscles and maintain a straight alignment from head to toe.\n\nLower your body:\n Bend your arms and gradually descend your body toward the surface, ensuring your elbows remain close \nto your sides.\n\nMaintain control:\n Pause briefly when you reach the bottom position, then use your arms and shoulders to push yourself back \nup.\n\nComplete the repetition:\n Fully extend your arms and return to the starting position.\n\nRepeat for desired reps:\n Perform the exercise for the desired number of repetitions while focusing on proper form and \ncontrolled movements.\n\nIncrease difficulty:\n To intensify the exercise, consider elevating your feet or incorporating unstable equipment like rings.\n\nBreathe rhythmically:\n Remember to maintain a steady breathing pattern throughout the exercise, exhaling as you push up \nand inhaling as you lower your body.\n\n", "VideoLink": "https:\/\/i.postimg.cc\/Gt96dmXQ\/BODY-UPS.gif", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "WALL PUSH-UP", "Description": "Position yourself:\n Stand at a comfortable distance facing a wall, with your feet shoulder-width apart.\n\nPlace your hands on the wall:\n Extend your arms and position your palms against the wall, slightly wider than your shoulders.\n\nEngage your core:\n Tighten your abdominal muscles to maintain a straight alignment from head to toe.\n\nLower your body:\n Bend your elbows and lean your body towards the wall, allowing your chest to approach it. Keep your feet planted on the \nground.\n\nControl your movements:\n Pause briefly when you're close to the wall, then use your palms to push back, extending your arms to return to the \nstarting position.\n\nRepeat for desired repetitions:\n Perform the exercise for your preferred number of reps, focusing on smooth and controlled movements.\n\nGradually increase difficulty:\n If you want to intensify the exercise, step slightly farther from the wall or elevate your hands using a bench or \nstep.\n\nMaintain a rhythmic breathing pattern: \nBreathe naturally, inhaling as you lower your body and exhaling as you push back up.\n\nProgress at your own pace:\n As you build strength, you can advance to more challenging variations like knee push-ups or full push-ups on the \nground.\n", "VideoLink": "https:\/\/i.postimg.cc\/Bb87Rwv7\/WALL-PUSH-UP.gif", "EQUIPMENT": "NO EQUIPMENT"}, {"Excerice Name": "CHAIR DIPS", "Description": "Position yourself: \nTake a seat on the edge of a sturdy chair, grasping the front edge with your palms and fingers facing forward.\n\nEstablish your foot placement: \nExtend your legs forward, keeping your heels grounded and knees slightly bent.\n\nEngage your core:\n Activate your abdominal muscles to maintain optimal posture during the exercise.\n\nDescend with control:\n Gradually bend your elbows, lowering your body toward the floor while keeping your back close to the chair.\n\nMaintain controlled movements:\n Pause momentarily when your elbows reach a 90-degree angle, then push through your palms to elevate \nyour body back to the starting position.\n\nRepeat to your desired repetitions:\n Perform the exercise for your preferred number of reps, focusing on smooth and controlled motions.\n\nAdjust for intensity:\n To intensify the exercise, extend your legs further or elevate your feet on another sturdy surface.\n\nBreathe rhythmically:\n Inhale as you descend and exhale as you ascend.\n\nGradual progression:\n As you build strength, challenge yourself by using a lower chair or adding weight on your lap.\n\nListen to your body:\n If you experience any discomfort or pain, modify the movement or seek guidance from a fitness professional.\n", "VideoLink": "https:\/\/i.postimg.cc\/QCPwtZPr\/CHAIR-DIPS.gif", "EQUIPMENT": "CHAIR"}, {"Excerice Name": "SEATED DUMBBELL TRICEPS EXTENSION", "Description": "Prepare your setup:\n Sit upright on a bench, ensuring your feet are planted firmly on the floor. Hold a dumbbell with both hands, positioning it\n behind your head.\n\nSecure your grip:\n Grasp the dumbbell firmly, with your palms facing upward and your elbows pointed forward.\n\nEngage your core:\n Activate your abdominal muscles to stabilize your body throughout the exercise.\n\nExtend your arms:\n Lift the dumbbell slowly by fully straightening your arms, while keeping your elbows close to your head.\n\nHold at the peak:\n Pause briefly in the extended position, ensuring a strong contraction in your triceps.\n\nLower the weight with control:\n Bend your elbows gradually and lower the dumbbell back behind your head, maintaining control throughout \nthe movement.\n\nRepeat as desired:\n Perform the exercise for your preferred number of repetitions, focusing on smooth and controlled movements.\n\nAdjust the weight accordingly:\n Choose a weight that challenges your muscles without compromising proper form.\n\nMaintain rhythmic breathing:\n Inhale as you lower the weight and exhale as you extend your arms.\n\nMonitor your range of motion:\n Avoid locking out your elbows at the top of the movement to prevent undue strain.\n\nListen to your body:\n If you experience any discomfort or pain, adjust the weight or consult a fitness professional for guidance.\n", "VideoLink": "https:\/\/i.postimg.cc\/Kz8HDYh2\/SEATED-DUMBBELL-TRICEPS-EXTENSION.gif", "EQUIPMENT": "Dumbbells"}, {"Excerice Name": "DUMBBELL SKULL CRUSHER", "Description": "Activate Your Triceps:\n Lower the dumbbells towards the sides of your head, bending your elbows. Focus \non engaging your triceps.\n\nControlled Motion:\n Pause briefly at the bottom, feeling a stretch. Extend your arms back up, utilizing \nyour triceps.\n\nMindful Technique:\n Maintain a controlled pace without swinging. Keep wrists aligned and proper elbow\n positioning.\n\nAdjust Weight and Repetitions:\n Start with lighter weights and progress gradually. Perform desired reps \nbased on your goals.\n\nBreathing and Rest:\n Inhale during lowering, exhale during lifting. Take short breaks between sets.\n\nSafety Considerations:\n Seek professional guidance for shoulder or elbow concerns. Avoid overextension \nand use proper form. Discontinue if pain or discomfort occurs.\n", "VideoLink": "https:\/\/i.postimg.cc\/hPkNRgTL\/DUMBBELL-SKULL-CRUSHER.gif", "EQUIPMENT": "Dumbbells"}]